import GHC.List
import Data.List(nub)
-- Лабораторна робота №3
-- студента групи АнД-31
-- Лаврія Руслана
-- Варіант №6
-- Мета: Набути досвiду визначення та використання функцiй вищого порядку.

-- Завдання 1. Видалити повтори елементiв списку
-- a) без застосування вбудованих функцій
unique :: [Int] -> [Int]
unique xs = [x | (x,y) <- zip xs [0..], x `notElem` (take y xs)]
-- unique[1,3,3,2,1,2,5]
--[1,3,2,5]

-- б) з застосуванням
-- ghci
-- import Data.List(nub)
-- nub [1,2,3,4,2,5,3,6,1,1]
--[1,2,3,4,5,6]

-- Завдання 2. Знайти найменше спiльне кратне двох чисел.
lcm :: Int -> Int -> Int
lcm x y =  abs ((x `quot` (gcd x y)) * y)
-- lcm 15 7
--105
-- lcm 18 24
--72
