import GHC.List
-- Лабораторна робота №2
-- студента групи АнД-31
-- Лаврія Руслана
-- Варіант №6
-- Мета: Набути досвiду визначення рекурсивних функцiй, використання механiзму
-- зiставлення зi зразком i роботи з кортежами та списками.

-- Завдання 1. Перетворити багаторівневий список на однорівневий
-- a) без застосування вбудованих функцій
myConcat :: [[a]] -> [a]
myConcat [] = []
myConcat (x:xs) = x ++ myConcat xs
-- myConcat [[1,2],[4,7,8]]
--[1,2,4,7,8]

-- б) з застосуванням
-- ghci
-- concat[[1,2,3],[2,3]]
--[1,2,3,2,1]

-- Завдання 2. Визначити чи є число простим
isPrime :: Integer -> Bool
isPrime k = length [ x | x <- [2..k], k `mod` x == 0] == 1
-- isPrime 11
--True
-- isPrime 9
--False

-- Висновок: під час цьої лабораторної роботи я працював з рекурсивними
-- функціями, побудував власну рекурсивну функцію для перетворення List of list to list
-- рекурсивним способом та побудував функцію для визначення простого числа.
